[Killed] BlockStatement
src/index.ts:21:48
  * @throws {TypeError} - Throws if the input is not a finite number.
  * @throws {RangeError} - Throws if the input is not an integer or exceeds the safe integer limit.
  */
-export const isOdd = (num: number): boolean => {
-	if (!Number.isFinite(num)) {
-		throw new TypeError("Expected a finite number");
-	}
-
-	if (!Number.isInteger(num)) {
-		throw new RangeError("Expected an integer");
-	}
-
-	if (!Number.isSafeInteger(num)) {
-		throw new RangeError("Value exceeds maximum safe integer");
-	}
-
-	return num % 2 !== 0;
-};
+export const isOdd = (num: number): boolean => {};
 
killedBy: All tests
statusReason: > is-odd-ts@2.0.2 test
> node --experimental-strip-types --test src/**/*.test.ts


TAP version 13

# (node:6732) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time

[Killed] ConditionalExpression
src/index.ts:22:6
  * @throws {RangeError} - Throws if the input is not an integer or exceeds the safe integer limit.
  */
 export const isOdd = (num: number): boolean => {
-	if (!Number.isFinite(num)) {
+	if (true) {
 		throw new TypeError("Expected a finite number");
 	}
killedBy: All tests
statusReason: > is-odd-ts@2.0.2 test
> node --experimental-strip-types --test src/**/*.test.ts


TAP version 13

# (node:23784) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time

[Killed] BooleanLiteral
src/index.ts:22:6
  * @throws {RangeError} - Throws if the input is not an integer or exceeds the safe integer limit.
  */
 export const isOdd = (num: number): boolean => {
-	if (!Number.isFinite(num)) {
+	if (Number.isFinite(num)) {
 		throw new TypeError("Expected a finite number");
 	}
killedBy: All tests
statusReason: > is-odd-ts@2.0.2 test
> node --experimental-strip-types --test src/**/*.test.ts


TAP version 13

# (node:23668) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time

[Killed] ConditionalExpression
src/index.ts:26:6
 		throw new TypeError("Expected a finite number");
 	}
 
-	if (!Number.isInteger(num)) {
+	if (true) {
 		throw new RangeError("Expected an integer");
 	}
killedBy: All tests
statusReason: > is-odd-ts@2.0.2 test
> node --experimental-strip-types --test src/**/*.test.ts


TAP version 13

# (node:24628) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time

[Killed] ConditionalExpression
src/index.ts:26:6
 		throw new TypeError("Expected a finite number");
 	}
 
-	if (!Number.isInteger(num)) {
+	if (false) {
 		throw new RangeError("Expected an integer");
 	}
killedBy: All tests
statusReason: > is-odd-ts@2.0.2 test
> node --experimental-strip-types --test src/**/*.test.ts


TAP version 13

# (node:25036) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time

[Killed] BlockStatement
src/index.ts:30:34
 		throw new RangeError("Expected an integer");
 	}
 
-	if (!Number.isSafeInteger(num)) {
-		throw new RangeError("Value exceeds maximum safe integer");
-	}
+	if (!Number.isSafeInteger(num)) {}
 
 	return num % 2 !== 0;
killedBy: All tests
statusReason: > is-odd-ts@2.0.2 test
> node --experimental-strip-types --test src/**/*.test.ts


TAP version 13

# (node:25108) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time

[Killed] ConditionalExpression
src/index.ts:30:6
 		throw new RangeError("Expected an integer");
 	}
 
-	if (!Number.isSafeInteger(num)) {
+	if (true) {
 		throw new RangeError("Value exceeds maximum safe integer");
 	}
killedBy: All tests
statusReason: > is-odd-ts@2.0.2 test
> node --experimental-strip-types --test src/**/*.test.ts


TAP version 13

# (node:25056) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time

[Killed] EqualityOperator
src/index.ts:34:9
 		throw new RangeError("Value exceeds maximum safe integer");
 	}
 
-	return num % 2 !== 0;
+	return num % 2 === 0;
 };
 
killedBy: All tests
statusReason: > is-odd-ts@2.0.2 test
> node --experimental-strip-types --test src/**/*.test.ts


TAP version 13

# (node:25364) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time

[Killed] ArithmeticOperator
src/index.ts:34:9
 		throw new RangeError("Value exceeds maximum safe integer");
 	}
 
-	return num % 2 !== 0;
+	return num * 2 !== 0;
 };
 
killedBy: All tests
statusReason: > is-odd-ts@2.0.2 test
> node --experimental-strip-types --test src/**/*.test.ts


TAP version 13

# (node:25176) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
