[Killed] BlockStatement
src/index.ts:21:48
  * @throws {TypeError} - Throws if the input is not a finite number or integer.
  * @throws {RangeError} - Throws if the input exceeds the safe integer limit.
  */
-export const isOdd = (num: number): boolean => {
-	if (!Number.isFinite(num)) {
-		throw new TypeError("Expected a finite number");
-	}
-
-	if (!Number.isInteger(num)) {
-		throw new TypeError("Expected an integer");
-	}
-
-	if (!Number.isSafeInteger(num)) {
-		throw new RangeError("Value exceeds maximum safe integer");
-	}
-
-	return num % 2 !== 0;
-};
+export const isOdd = (num: number): boolean => {};
 
killedBy: All tests
statusReason: > is-odd-ts@2.0.3 test
> tsx --test


▶ isOdd function with integers
  ✖ should return true when the input is an odd positive integer (8.428225ms)
  ✖ should return true when the input is an odd negative integer (4.678515ms)
  ✖ should return false when the input is an even positive integer (4.184663ms)

[Killed] StringLiteral
src/index.ts:27:23
 	}
 
 	if (!Number.isInteger(num)) {
-		throw new TypeError("Expected an integer");
+		throw new TypeError("");
 	}
 
killedBy: All tests
statusReason: > is-odd-ts@2.0.2 test
> node --experimental-strip-types --test src/**/*.test.ts


TAP version 13

# (node:25292) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
